# ShearAreaStrongAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..ShearAreaStrongAxis Property
StructuralSection Class See Also
---
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double ShearAreaStrongAxis { get; set; }
```

Visual Basic
---
```text
Public Property ShearAreaStrongAxis As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ShearAreaStrongAxis {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace